Microchip-MPLAB-Harmony/csp/apps/sercom/usart/usart_echo_interrupt/firmware/src/packs/ATSAML10E16A_DFP/component/dwt.h
/**
 * \brief Component description for DWT
 *
 * © 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-05-31T10:20:47Z */
#ifndef _SAML10_DWT_COMPONENT_H_
#define _SAML10_DWT_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DWT                                          */
/* ************************************************************************** */

/* -------- DWT_COMP : (DWT Offset: 0x00) (R/W 32) DWT Comparator Register n -------- */
#define DWT_COMP_VALUE_Pos                    _U_(0)                                         /**< (DWT_COMP) Cycle/PC/data value or data address Position */
#define DWT_COMP_VALUE_Msk                    (_U_(0xFFFFFFFF) << DWT_COMP_VALUE_Pos)        /**< (DWT_COMP) Cycle/PC/data value or data address Mask */
#define DWT_COMP_VALUE(value)                 (DWT_COMP_VALUE_Msk & ((value) << DWT_COMP_VALUE_Pos))
#define DWT_COMP_Msk                          _U_(0xFFFFFFFF)                                /**< (DWT_COMP) Register Mask  */


/* -------- DWT_FUNCTION : (DWT Offset: 0x08) (R/W 32) DWT Function Register x -------- */
#define DWT_FUNCTION_MATCH_Pos                _U_(0)                                         /**< (DWT_FUNCTION) Match type Position */
#define DWT_FUNCTION_MATCH_Msk                (_U_(0xF) << DWT_FUNCTION_MATCH_Pos)           /**< (DWT_FUNCTION) Match type Mask */
#define DWT_FUNCTION_MATCH(value)             (DWT_FUNCTION_MATCH_Msk & ((value) << DWT_FUNCTION_MATCH_Pos))
#define DWT_FUNCTION_ACTION_Pos               _U_(4)                                         /**< (DWT_FUNCTION) Action on match Position */
#define DWT_FUNCTION_ACTION_Msk               (_U_(0x3) << DWT_FUNCTION_ACTION_Pos)          /**< (DWT_FUNCTION) Action on match Mask */
#define DWT_FUNCTION_ACTION(value)            (DWT_FUNCTION_ACTION_Msk & ((value) << DWT_FUNCTION_ACTION_Pos))
#define DWT_FUNCTION_DATAVSIZE_Pos            _U_(10)                                        /**< (DWT_FUNCTION) Data value size Position */
#define DWT_FUNCTION_DATAVSIZE_Msk            (_U_(0x3) << DWT_FUNCTION_DATAVSIZE_Pos)       /**< (DWT_FUNCTION) Data value size Mask */
#define DWT_FUNCTION_DATAVSIZE(value)         (DWT_FUNCTION_DATAVSIZE_Msk & ((value) << DWT_FUNCTION_DATAVSIZE_Pos))
#define DWT_FUNCTION_MATCHED_Pos              _U_(24)                                        /**< (DWT_FUNCTION) Comparator matched Position */
#define DWT_FUNCTION_MATCHED_Msk              (_U_(0x1) << DWT_FUNCTION_MATCHED_Pos)         /**< (DWT_FUNCTION) Comparator matched Mask */
#define DWT_FUNCTION_ID_Pos                   _U_(27)                                        /**< (DWT_FUNCTION) Identify capability Position */
#define DWT_FUNCTION_ID_Msk                   (_U_(0x1F) << DWT_FUNCTION_ID_Pos)             /**< (DWT_FUNCTION) Identify capability Mask */
#define DWT_FUNCTION_ID(value)                (DWT_FUNCTION_ID_Msk & ((value) << DWT_FUNCTION_ID_Pos))
#define DWT_FUNCTION_Msk                      _U_(0xF9000C3F)                                /**< (DWT_FUNCTION) Register Mask  */


/* -------- DWT_CTRL : (DWT Offset: 0x00) (R/W 32) DWT Control Register -------- */
#define DWT_CTRL_RESETVALUE                 _U_(0xB000000)                                /**<  (DWT_CTRL) DWT Control Register  Reset Value */

#define DWT_CTRL_CYCCNTENA_Pos                _U_(0)                                         /**< (DWT_CTRL) CYCCNT enable Position */
#define DWT_CTRL_CYCCNTENA_Msk                (_U_(0x1) << DWT_CTRL_CYCCNTENA_Pos)           /**< (DWT_CTRL) CYCCNT enable Mask */
#define DWT_CTRL_POSTPRESET_Pos               _U_(1)                                         /**< (DWT_CTRL) POSTCNT preset Position */
#define DWT_CTRL_POSTPRESET_Msk               (_U_(0xF) << DWT_CTRL_POSTPRESET_Pos)          /**< (DWT_CTRL) POSTCNT preset Mask */
#define DWT_CTRL_POSTPRESET(value)            (DWT_CTRL_POSTPRESET_Msk & ((value) << DWT_CTRL_POSTPRESET_Pos))
#define DWT_CTRL_POSTINIT_Pos                 _U_(5)                                         /**< (DWT_CTRL) POSTCNT initial Position */
#define DWT_CTRL_POSTINIT_Msk                 (_U_(0xF) << DWT_CTRL_POSTINIT_Pos)            /**< (DWT_CTRL) POSTCNT initial Mask */
#define DWT_CTRL_POSTINIT(value)              (DWT_CTRL_POSTINIT_Msk & ((value) << DWT_CTRL_POSTINIT_Pos))
#define DWT_CTRL_CYCTAP_Pos                   _U_(9)                                         /**< (DWT_CTRL) Cycle count tap Position */
#define DWT_CTRL_CYCTAP_Msk                   (_U_(0x1) << DWT_CTRL_CYCTAP_Pos)              /**< (DWT_CTRL) Cycle count tap Mask */
#define DWT_CTRL_SYNCTAP_Pos                  _U_(10)                                        /**< (DWT_CTRL) Synchronization tap Position */
#define DWT_CTRL_SYNCTAP_Msk                  (_U_(0x3) << DWT_CTRL_SYNCTAP_Pos)             /**< (DWT_CTRL) Synchronization tap Mask */
#define DWT_CTRL_SYNCTAP(value)               (DWT_CTRL_SYNCTAP_Msk & ((value) << DWT_CTRL_SYNCTAP_Pos))
#define DWT_CTRL_PCSAMPLENA_Pos               _U_(12)                                        /**< (DWT_CTRL) PC sample enable Position */
#define DWT_CTRL_PCSAMPLENA_Msk               (_U_(0x1) << DWT_CTRL_PCSAMPLENA_Pos)          /**< (DWT_CTRL) PC sample enable Mask */
#define DWT_CTRL_EXCTRCENA_Pos                _U_(16)                                        /**< (DWT_CTRL) Exception trace enable Position */
#define DWT_CTRL_EXCTRCENA_Msk                (_U_(0x1) << DWT_CTRL_EXCTRCENA_Pos)           /**< (DWT_CTRL) Exception trace enable Mask */
#define DWT_CTRL_CPIEVTENA_Pos                _U_(17)                                        /**< (DWT_CTRL) CPI event enable Position */
#define DWT_CTRL_CPIEVTENA_Msk                (_U_(0x1) << DWT_CTRL_CPIEVTENA_Pos)           /**< (DWT_CTRL) CPI event enable Mask */
#define DWT_CTRL_EXCEVTENA_Pos                _U_(18)                                        /**< (DWT_CTRL) Exception event enable Position */
#define DWT_CTRL_EXCEVTENA_Msk                (_U_(0x1) << DWT_CTRL_EXCEVTENA_Pos)           /**< (DWT_CTRL) Exception event enable Mask */
#define DWT_CTRL_SLEEPEVTENA_Pos              _U_(19)                                        /**< (DWT_CTRL) Sleep event enable Position */
#define DWT_CTRL_SLEEPEVTENA_Msk              (_U_(0x1) << DWT_CTRL_SLEEPEVTENA_Pos)         /**< (DWT_CTRL) Sleep event enable Mask */
#define DWT_CTRL_LSUEVTENA_Pos                _U_(20)                                        /**< (DWT_CTRL) LSU event enable Position */
#define DWT_CTRL_LSUEVTENA_Msk                (_U_(0x1) << DWT_CTRL_LSUEVTENA_Pos)           /**< (DWT_CTRL) LSU event enable Mask */
#define DWT_CTRL_FOLDEVTENA_Pos               _U_(21)                                        /**< (DWT_CTRL) Fold event enable Position */
#define DWT_CTRL_FOLDEVTENA_Msk               (_U_(0x1) << DWT_CTRL_FOLDEVTENA_Pos)          /**< (DWT_CTRL) Fold event enable Mask */
#define DWT_CTRL_CYCEVTENA_Pos                _U_(22)                                        /**< (DWT_CTRL) Cycle event enable Position */
#define DWT_CTRL_CYCEVTENA_Msk                (_U_(0x1) << DWT_CTRL_CYCEVTENA_Pos)           /**< (DWT_CTRL) Cycle event enable Mask */
#define DWT_CTRL_CYCDISS_Pos                  _U_(23)                                        /**< (DWT_CTRL) Cycle counter disabled secure Position */
#define DWT_CTRL_CYCDISS_Msk                  (_U_(0x1) << DWT_CTRL_CYCDISS_Pos)             /**< (DWT_CTRL) Cycle counter disabled secure Mask */
#define DWT_CTRL_NOPRFCNT_Pos                 _U_(24)                                        /**< (DWT_CTRL) No profile counters Position */
#define DWT_CTRL_NOPRFCNT_Msk                 (_U_(0x1) << DWT_CTRL_NOPRFCNT_Pos)            /**< (DWT_CTRL) No profile counters Mask */
#define DWT_CTRL_NOCYCCNT_Pos                 _U_(25)                                        /**< (DWT_CTRL) No cycle count Position */
#define DWT_CTRL_NOCYCCNT_Msk                 (_U_(0x1) << DWT_CTRL_NOCYCCNT_Pos)            /**< (DWT_CTRL) No cycle count Mask */
#define DWT_CTRL_NOEXTTRIG_Pos                _U_(26)                                        /**< (DWT_CTRL) No external triggers Position */
#define DWT_CTRL_NOEXTTRIG_Msk                (_U_(0x1) << DWT_CTRL_NOEXTTRIG_Pos)           /**< (DWT_CTRL) No external triggers Mask */
#define DWT_CTRL_NOTRCPKT_Pos                 _U_(27)                                        /**< (DWT_CTRL) No trace packets Position */
#define DWT_CTRL_NOTRCPKT_Msk                 (_U_(0x1) << DWT_CTRL_NOTRCPKT_Pos)            /**< (DWT_CTRL) No trace packets Mask */
#define DWT_CTRL_NUMCOMP_Pos                  _U_(28)                                        /**< (DWT_CTRL) Number of comparators Position */
#define DWT_CTRL_NUMCOMP_Msk                  (_U_(0xF) << DWT_CTRL_NUMCOMP_Pos)             /**< (DWT_CTRL) Number of comparators Mask */
#define DWT_CTRL_NUMCOMP(value)               (DWT_CTRL_NUMCOMP_Msk & ((value) << DWT_CTRL_NUMCOMP_Pos))
#define DWT_CTRL_Msk                          _U_(0xFFFF1FFF)                                /**< (DWT_CTRL) Register Mask  */


/* -------- DWT_PCSR : (DWT Offset: 0x1C) ( R/ 32) DWT Program Counter Sample Register -------- */
#define DWT_PCSR_EIASAMPLE_Pos                _U_(0)                                         /**< (DWT_PCSR) Executed instruction address sample Position */
#define DWT_PCSR_EIASAMPLE_Msk                (_U_(0xFFFFFFFF) << DWT_PCSR_EIASAMPLE_Pos)    /**< (DWT_PCSR) Executed instruction address sample Mask */
#define DWT_PCSR_EIASAMPLE(value)             (DWT_PCSR_EIASAMPLE_Msk & ((value) << DWT_PCSR_EIASAMPLE_Pos))
#define DWT_PCSR_Msk                          _U_(0xFFFFFFFF)                                /**< (DWT_PCSR) Register Mask  */


/* -------- DWT_LAR : (DWT Offset: 0xFB0) ( /W 32) DWT Software Lock Access Register -------- */
#define DWT_LAR_KEY_Pos                       _U_(0)                                         /**< (DWT_LAR) Lock access control Position */
#define DWT_LAR_KEY_Msk                       (_U_(0xFFFFFFFF) << DWT_LAR_KEY_Pos)           /**< (DWT_LAR) Lock access control Mask */
#define DWT_LAR_KEY(value)                    (DWT_LAR_KEY_Msk & ((value) << DWT_LAR_KEY_Pos))
#define   DWT_LAR_KEY_UNLOCK_Val              _U_(0xC5ACCE55)                                /**< (DWT_LAR) Unlock key value  */
#define DWT_LAR_KEY_UNLOCK                    (DWT_LAR_KEY_UNLOCK_Val << DWT_LAR_KEY_Pos)    /**< (DWT_LAR) Unlock key value Position  */
#define DWT_LAR_Msk                           _U_(0xFFFFFFFF)                                /**< (DWT_LAR) Register Mask  */


/* -------- DWT_LSR : (DWT Offset: 0xFB4) ( R/ 32) DWT Software Lock Status Register -------- */
#define DWT_LSR_SLI_Pos                       _U_(0)                                         /**< (DWT_LSR) Software Lock implemented Position */
#define DWT_LSR_SLI_Msk                       (_U_(0x1) << DWT_LSR_SLI_Pos)                  /**< (DWT_LSR) Software Lock implemented Mask */
#define DWT_LSR_SLK_Pos                       _U_(1)                                         /**< (DWT_LSR) Software Lock status Position */
#define DWT_LSR_SLK_Msk                       (_U_(0x1) << DWT_LSR_SLK_Pos)                  /**< (DWT_LSR) Software Lock status Mask */
#define DWT_LSR_nTT_Pos                       _U_(2)                                         /**< (DWT_LSR) Not thirty-two bit Position */
#define DWT_LSR_nTT_Msk                       (_U_(0x1) << DWT_LSR_nTT_Pos)                  /**< (DWT_LSR) Not thirty-two bit Mask */
#define DWT_LSR_Msk                           _U_(0x00000007)                                /**< (DWT_LSR) Register Mask  */


/* -------- DWT_DEVARCH : (DWT Offset: 0xFBC) ( R/ 32) DWT Device Architecture Register -------- */
#define DWT_DEVARCH_RESETVALUE              _U_(0x47701A02)                               /**<  (DWT_DEVARCH) DWT Device Architecture Register  Reset Value */

