Microchip-MPLAB-Harmony/csp/apps/sercom/usart/usart_echo_interrupt/firmware/src/packs/ATSAML10E16A_DFP/component/dwt.h
#define DWT_DEVARCH_ARCHPART_Pos              _U_(0)                                         /**< (DWT_DEVARCH) Architecture Part Position */
#define DWT_DEVARCH_ARCHPART_Msk              (_U_(0xFFF) << DWT_DEVARCH_ARCHPART_Pos)       /**< (DWT_DEVARCH) Architecture Part Mask */
#define DWT_DEVARCH_ARCHPART(value)           (DWT_DEVARCH_ARCHPART_Msk & ((value) << DWT_DEVARCH_ARCHPART_Pos))
#define DWT_DEVARCH_ARCHVER_Pos               _U_(12)                                        /**< (DWT_DEVARCH) Architecture Version Position */
#define DWT_DEVARCH_ARCHVER_Msk               (_U_(0xF) << DWT_DEVARCH_ARCHVER_Pos)          /**< (DWT_DEVARCH) Architecture Version Mask */
#define DWT_DEVARCH_ARCHVER(value)            (DWT_DEVARCH_ARCHVER_Msk & ((value) << DWT_DEVARCH_ARCHVER_Pos))
#define DWT_DEVARCH_REVISION_Pos              _U_(16)                                        /**< (DWT_DEVARCH) Revision Position */
#define DWT_DEVARCH_REVISION_Msk              (_U_(0xF) << DWT_DEVARCH_REVISION_Pos)         /**< (DWT_DEVARCH) Revision Mask */
#define DWT_DEVARCH_REVISION(value)           (DWT_DEVARCH_REVISION_Msk & ((value) << DWT_DEVARCH_REVISION_Pos))
#define DWT_DEVARCH_PRESENT_Pos               _U_(20)                                        /**< (DWT_DEVARCH) DEVARCH Present Position */
#define DWT_DEVARCH_PRESENT_Msk               (_U_(0x1) << DWT_DEVARCH_PRESENT_Pos)          /**< (DWT_DEVARCH) DEVARCH Present Mask */
#define DWT_DEVARCH_ARCHITECT_Pos             _U_(21)                                        /**< (DWT_DEVARCH) Architect Position */
#define DWT_DEVARCH_ARCHITECT_Msk             (_U_(0x7FF) << DWT_DEVARCH_ARCHITECT_Pos)      /**< (DWT_DEVARCH) Architect Mask */
#define DWT_DEVARCH_ARCHITECT(value)          (DWT_DEVARCH_ARCHITECT_Msk & ((value) << DWT_DEVARCH_ARCHITECT_Pos))
#define DWT_DEVARCH_Msk                       _U_(0xFFFFFFFF)                                /**< (DWT_DEVARCH) Register Mask  */


/* -------- DWT_DEVTYPE : (DWT Offset: 0xFCC) ( R/ 32) DWT Device Type Register -------- */
#define DWT_DEVTYPE_RESETVALUE              _U_(0x00)                                     /**<  (DWT_DEVTYPE) DWT Device Type Register  Reset Value */

#define DWT_DEVTYPE_MAJOR_Pos                 _U_(0)                                         /**< (DWT_DEVTYPE) Major type Position */
#define DWT_DEVTYPE_MAJOR_Msk                 (_U_(0xF) << DWT_DEVTYPE_MAJOR_Pos)            /**< (DWT_DEVTYPE) Major type Mask */
#define DWT_DEVTYPE_MAJOR(value)              (DWT_DEVTYPE_MAJOR_Msk & ((value) << DWT_DEVTYPE_MAJOR_Pos))
#define DWT_DEVTYPE_SUB_Pos                   _U_(4)                                         /**< (DWT_DEVTYPE) Sub-type Position */
#define DWT_DEVTYPE_SUB_Msk                   (_U_(0xF) << DWT_DEVTYPE_SUB_Pos)              /**< (DWT_DEVTYPE) Sub-type Mask */
#define DWT_DEVTYPE_SUB(value)                (DWT_DEVTYPE_SUB_Msk & ((value) << DWT_DEVTYPE_SUB_Pos))
#define DWT_DEVTYPE_Msk                       _U_(0x000000FF)                                /**< (DWT_DEVTYPE) Register Mask  */


/* -------- DWT_PIDR4 : (DWT Offset: 0xFD0) ( R/ 32) DWT Peripheral Identification Register 4 -------- */
#define DWT_PIDR4_DES_2_Pos                   _U_(0)                                         /**< (DWT_PIDR4) JEP106 continuation code Position */
#define DWT_PIDR4_DES_2_Msk                   (_U_(0xF) << DWT_PIDR4_DES_2_Pos)              /**< (DWT_PIDR4) JEP106 continuation code Mask */
#define DWT_PIDR4_DES_2(value)                (DWT_PIDR4_DES_2_Msk & ((value) << DWT_PIDR4_DES_2_Pos))
#define DWT_PIDR4_SIZE_Pos                    _U_(4)                                         /**< (DWT_PIDR4) 4KB count Position */
#define DWT_PIDR4_SIZE_Msk                    (_U_(0xF) << DWT_PIDR4_SIZE_Pos)               /**< (DWT_PIDR4) 4KB count Mask */
#define DWT_PIDR4_SIZE(value)                 (DWT_PIDR4_SIZE_Msk & ((value) << DWT_PIDR4_SIZE_Pos))
#define DWT_PIDR4_Msk                         _U_(0x000000FF)                                /**< (DWT_PIDR4) Register Mask  */


/* -------- DWT_PIDR5 : (DWT Offset: 0xFD4) ( R/ 32) DWT Peripheral Identification Register 5 -------- */
#define DWT_PIDR5_RESETVALUE                _U_(0x00)                                     /**<  (DWT_PIDR5) DWT Peripheral Identification Register 5  Reset Value */

#define DWT_PIDR5_Msk                         _U_(0x00000000)                                /**< (DWT_PIDR5) Register Mask  */


/* -------- DWT_PIDR6 : (DWT Offset: 0xFD8) ( R/ 32) DWT Peripheral Identification Register 6 -------- */
#define DWT_PIDR6_RESETVALUE                _U_(0x00)                                     /**<  (DWT_PIDR6) DWT Peripheral Identification Register 6  Reset Value */

#define DWT_PIDR6_Msk                         _U_(0x00000000)                                /**< (DWT_PIDR6) Register Mask  */


/* -------- DWT_PIDR7 : (DWT Offset: 0xFDC) ( R/ 32) DWT Peripheral Identification Register 7 -------- */
#define DWT_PIDR7_RESETVALUE                _U_(0x00)                                     /**<  (DWT_PIDR7) DWT Peripheral Identification Register 7  Reset Value */

#define DWT_PIDR7_Msk                         _U_(0x00000000)                                /**< (DWT_PIDR7) Register Mask  */


/* -------- DWT_PIDR0 : (DWT Offset: 0xFE0) ( R/ 32) DWT Peripheral Identification Register 0 -------- */
#define DWT_PIDR0_PART_0_Pos                  _U_(0)                                         /**< (DWT_PIDR0) Part number bits[7:0] Position */
#define DWT_PIDR0_PART_0_Msk                  (_U_(0xFF) << DWT_PIDR0_PART_0_Pos)            /**< (DWT_PIDR0) Part number bits[7:0] Mask */
#define DWT_PIDR0_PART_0(value)               (DWT_PIDR0_PART_0_Msk & ((value) << DWT_PIDR0_PART_0_Pos))
#define DWT_PIDR0_Msk                         _U_(0x000000FF)                                /**< (DWT_PIDR0) Register Mask  */


/* -------- DWT_PIDR1 : (DWT Offset: 0xFE4) ( R/ 32) DWT Peripheral Identification Register 1 -------- */
#define DWT_PIDR1_PART_1_Pos                  _U_(0)                                         /**< (DWT_PIDR1) Part number bits[11:8] Position */
#define DWT_PIDR1_PART_1_Msk                  (_U_(0xF) << DWT_PIDR1_PART_1_Pos)             /**< (DWT_PIDR1) Part number bits[11:8] Mask */
#define DWT_PIDR1_PART_1(value)               (DWT_PIDR1_PART_1_Msk & ((value) << DWT_PIDR1_PART_1_Pos))
#define DWT_PIDR1_DES_0_Pos                   _U_(4)                                         /**< (DWT_PIDR1) JEP106 identification code bits [3:0] Position */
#define DWT_PIDR1_DES_0_Msk                   (_U_(0xF) << DWT_PIDR1_DES_0_Pos)              /**< (DWT_PIDR1) JEP106 identification code bits [3:0] Mask */
#define DWT_PIDR1_DES_0(value)                (DWT_PIDR1_DES_0_Msk & ((value) << DWT_PIDR1_DES_0_Pos))
#define DWT_PIDR1_Msk                         _U_(0x000000FF)                                /**< (DWT_PIDR1) Register Mask  */


/* -------- DWT_PIDR2 : (DWT Offset: 0xFE8) ( R/ 32) DWT Peripheral Identification Register 2 -------- */
#define DWT_PIDR2_DES_1_Pos                   _U_(0)                                         /**< (DWT_PIDR2) JEP106 identification code bits[6:4] Position */
#define DWT_PIDR2_DES_1_Msk                   (_U_(0x7) << DWT_PIDR2_DES_1_Pos)              /**< (DWT_PIDR2) JEP106 identification code bits[6:4] Mask */
#define DWT_PIDR2_DES_1(value)                (DWT_PIDR2_DES_1_Msk & ((value) << DWT_PIDR2_DES_1_Pos))
#define DWT_PIDR2_JEDEC_Pos                   _U_(3)                                         /**< (DWT_PIDR2) JEDEC assignee value is used Position */
#define DWT_PIDR2_JEDEC_Msk                   (_U_(0x1) << DWT_PIDR2_JEDEC_Pos)              /**< (DWT_PIDR2) JEDEC assignee value is used Mask */
#define DWT_PIDR2_REVISION_Pos                _U_(4)                                         /**< (DWT_PIDR2) Component revision Position */
#define DWT_PIDR2_REVISION_Msk                (_U_(0xF) << DWT_PIDR2_REVISION_Pos)           /**< (DWT_PIDR2) Component revision Mask */
#define DWT_PIDR2_REVISION(value)             (DWT_PIDR2_REVISION_Msk & ((value) << DWT_PIDR2_REVISION_Pos))
#define DWT_PIDR2_Msk                         _U_(0x000000FF)                                /**< (DWT_PIDR2) Register Mask  */


/* -------- DWT_PIDR3 : (DWT Offset: 0xFEC) ( R/ 32) DWT Peripheral Identification Register 3 -------- */
#define DWT_PIDR3_CMOD_Pos                    _U_(0)                                         /**< (DWT_PIDR3) Customer Modified Position */
#define DWT_PIDR3_CMOD_Msk                    (_U_(0xF) << DWT_PIDR3_CMOD_Pos)               /**< (DWT_PIDR3) Customer Modified Mask */
#define DWT_PIDR3_CMOD(value)                 (DWT_PIDR3_CMOD_Msk & ((value) << DWT_PIDR3_CMOD_Pos))
#define DWT_PIDR3_REVAND_Pos                  _U_(4)                                         /**< (DWT_PIDR3) RevAnd Position */
#define DWT_PIDR3_REVAND_Msk                  (_U_(0xF) << DWT_PIDR3_REVAND_Pos)             /**< (DWT_PIDR3) RevAnd Mask */
#define DWT_PIDR3_REVAND(value)               (DWT_PIDR3_REVAND_Msk & ((value) << DWT_PIDR3_REVAND_Pos))
#define DWT_PIDR3_Msk                         _U_(0x000000FF)                                /**< (DWT_PIDR3) Register Mask  */


/* -------- DWT_CIDR0 : (DWT Offset: 0xFF0) ( R/ 32) DWT Component Identification Register 0 -------- */
#define DWT_CIDR0_RESETVALUE                _U_(0x0D)                                     /**<  (DWT_CIDR0) DWT Component Identification Register 0  Reset Value */

#define DWT_CIDR0_PRMBL_0_Pos                 _U_(0)                                         /**< (DWT_CIDR0) CoreSight component identification preamble Position */
#define DWT_CIDR0_PRMBL_0_Msk                 (_U_(0xFF) << DWT_CIDR0_PRMBL_0_Pos)           /**< (DWT_CIDR0) CoreSight component identification preamble Mask */
#define DWT_CIDR0_PRMBL_0(value)              (DWT_CIDR0_PRMBL_0_Msk & ((value) << DWT_CIDR0_PRMBL_0_Pos))
#define DWT_CIDR0_Msk                         _U_(0x000000FF)                                /**< (DWT_CIDR0) Register Mask  */


/* -------- DWT_CIDR1 : (DWT Offset: 0xFF4) ( R/ 32) DWT Component Identification Register 1 -------- */
#define DWT_CIDR1_RESETVALUE                _U_(0x90)                                     /**<  (DWT_CIDR1) DWT Component Identification Register 1  Reset Value */

