Microchip-MPLAB-Harmony/csp/apps/sercom/usart/usart_echo_interrupt/firmware/src/packs/ATSAML10E16A_DFP/component/dwt.h
#define DWT_CIDR1_PRMBL_1_Pos                 _U_(0)                                         /**< (DWT_CIDR1) CoreSight component identification preamble Position */
#define DWT_CIDR1_PRMBL_1_Msk                 (_U_(0xF) << DWT_CIDR1_PRMBL_1_Pos)            /**< (DWT_CIDR1) CoreSight component identification preamble Mask */
#define DWT_CIDR1_PRMBL_1(value)              (DWT_CIDR1_PRMBL_1_Msk & ((value) << DWT_CIDR1_PRMBL_1_Pos))
#define DWT_CIDR1_CLASS_Pos                   _U_(4)                                         /**< (DWT_CIDR1) CoreSight component class Position */
#define DWT_CIDR1_CLASS_Msk                   (_U_(0xF) << DWT_CIDR1_CLASS_Pos)              /**< (DWT_CIDR1) CoreSight component class Mask */
#define DWT_CIDR1_CLASS(value)                (DWT_CIDR1_CLASS_Msk & ((value) << DWT_CIDR1_CLASS_Pos))
#define DWT_CIDR1_Msk                         _U_(0x000000FF)                                /**< (DWT_CIDR1) Register Mask  */


/* -------- DWT_CIDR2 : (DWT Offset: 0xFF8) ( R/ 32) DWT Component Identification Register 2 -------- */
#define DWT_CIDR2_RESETVALUE                _U_(0x05)                                     /**<  (DWT_CIDR2) DWT Component Identification Register 2  Reset Value */

#define DWT_CIDR2_PRMBL_2_Pos                 _U_(0)                                         /**< (DWT_CIDR2) CoreSight component identification preamble Position */
#define DWT_CIDR2_PRMBL_2_Msk                 (_U_(0xFF) << DWT_CIDR2_PRMBL_2_Pos)           /**< (DWT_CIDR2) CoreSight component identification preamble Mask */
#define DWT_CIDR2_PRMBL_2(value)              (DWT_CIDR2_PRMBL_2_Msk & ((value) << DWT_CIDR2_PRMBL_2_Pos))
#define DWT_CIDR2_Msk                         _U_(0x000000FF)                                /**< (DWT_CIDR2) Register Mask  */


/* -------- DWT_CIDR3 : (DWT Offset: 0xFFC) ( R/ 32) DWT Component Identification Register 3 -------- */
#define DWT_CIDR3_RESETVALUE                _U_(0xB1)                                     /**<  (DWT_CIDR3) DWT Component Identification Register 3  Reset Value */

#define DWT_CIDR3_PRMBL_3_Pos                 _U_(0)                                         /**< (DWT_CIDR3) CoreSight component identification preamble Position */
#define DWT_CIDR3_PRMBL_3_Msk                 (_U_(0xFF) << DWT_CIDR3_PRMBL_3_Pos)           /**< (DWT_CIDR3) CoreSight component identification preamble Mask */
#define DWT_CIDR3_PRMBL_3(value)              (DWT_CIDR3_PRMBL_3_Msk & ((value) << DWT_CIDR3_PRMBL_3_Pos))
#define DWT_CIDR3_Msk                         _U_(0x000000FF)                                /**< (DWT_CIDR3) Register Mask  */


/** \brief DWT register offsets definitions */
#define DWT_COMP_REG_OFST              (0x00)         /**< (DWT_COMP) DWT Comparator Register n Offset */
#define DWT_FUNCTION_REG_OFST          (0x08)         /**< (DWT_FUNCTION) DWT Function Register x Offset */
#define DWT_CTRL_REG_OFST              (0x00)         /**< (DWT_CTRL) DWT Control Register Offset */
#define DWT_PCSR_REG_OFST              (0x1C)         /**< (DWT_PCSR) DWT Program Counter Sample Register Offset */
#define DWT_LAR_REG_OFST               (0xFB0)        /**< (DWT_LAR) DWT Software Lock Access Register Offset */
#define DWT_LSR_REG_OFST               (0xFB4)        /**< (DWT_LSR) DWT Software Lock Status Register Offset */
#define DWT_DEVARCH_REG_OFST           (0xFBC)        /**< (DWT_DEVARCH) DWT Device Architecture Register Offset */
#define DWT_DEVTYPE_REG_OFST           (0xFCC)        /**< (DWT_DEVTYPE) DWT Device Type Register Offset */
#define DWT_PIDR4_REG_OFST             (0xFD0)        /**< (DWT_PIDR4) DWT Peripheral Identification Register 4 Offset */
#define DWT_PIDR5_REG_OFST             (0xFD4)        /**< (DWT_PIDR5) DWT Peripheral Identification Register 5 Offset */
#define DWT_PIDR6_REG_OFST             (0xFD8)        /**< (DWT_PIDR6) DWT Peripheral Identification Register 6 Offset */
#define DWT_PIDR7_REG_OFST             (0xFDC)        /**< (DWT_PIDR7) DWT Peripheral Identification Register 7 Offset */
#define DWT_PIDR0_REG_OFST             (0xFE0)        /**< (DWT_PIDR0) DWT Peripheral Identification Register 0 Offset */
#define DWT_PIDR1_REG_OFST             (0xFE4)        /**< (DWT_PIDR1) DWT Peripheral Identification Register 1 Offset */
#define DWT_PIDR2_REG_OFST             (0xFE8)        /**< (DWT_PIDR2) DWT Peripheral Identification Register 2 Offset */
#define DWT_PIDR3_REG_OFST             (0xFEC)        /**< (DWT_PIDR3) DWT Peripheral Identification Register 3 Offset */
#define DWT_CIDR0_REG_OFST             (0xFF0)        /**< (DWT_CIDR0) DWT Component Identification Register 0 Offset */
#define DWT_CIDR1_REG_OFST             (0xFF4)        /**< (DWT_CIDR1) DWT Component Identification Register 1 Offset */
#define DWT_CIDR2_REG_OFST             (0xFF8)        /**< (DWT_CIDR2) DWT Component Identification Register 2 Offset */
#define DWT_CIDR3_REG_OFST             (0xFFC)        /**< (DWT_CIDR3) DWT Component Identification Register 3 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief COMPARATOR register API structure */
typedef struct
{
  __IO  uint32_t                       DWT_COMP;        /**< Offset: 0x00 (R/W  32) DWT Comparator Register n */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       DWT_FUNCTION;    /**< Offset: 0x08 (R/W  32) DWT Function Register x */
  __I   uint8_t                        Reserved2[0x04];
} dwt_comparator_registers_t;

#define COMPARATOR_NUMBER _U_(2)

/** \brief DWT register API structure */
typedef struct
{  /* Data Watchpoint and Trace */
  __IO  uint32_t                       DWT_CTRL;        /**< Offset: 0x00 (R/W  32) DWT Control Register */
  __I   uint8_t                        Reserved1[0x18];
  __I   uint32_t                       DWT_PCSR;        /**< Offset: 0x1C (R/   32) DWT Program Counter Sample Register */
        dwt_comparator_registers_t     COMPARATOR[COMPARATOR_NUMBER]; /**< Offset: 0x20  */
  __I   uint8_t                        Reserved2[0xF70];
  __O   uint32_t                       DWT_LAR;         /**< Offset: 0xFB0 ( /W  32) DWT Software Lock Access Register */
  __I   uint32_t                       DWT_LSR;         /**< Offset: 0xFB4 (R/   32) DWT Software Lock Status Register */
  __I   uint8_t                        Reserved3[0x04];
  __I   uint32_t                       DWT_DEVARCH;     /**< Offset: 0xFBC (R/   32) DWT Device Architecture Register */
  __I   uint8_t                        Reserved4[0x0C];
  __I   uint32_t                       DWT_DEVTYPE;     /**< Offset: 0xFCC (R/   32) DWT Device Type Register */
  __I   uint32_t                       DWT_PIDR4;       /**< Offset: 0xFD0 (R/   32) DWT Peripheral Identification Register 4 */
  __I   uint32_t                       DWT_PIDR5;       /**< Offset: 0xFD4 (R/   32) DWT Peripheral Identification Register 5 */
  __I   uint32_t                       DWT_PIDR6;       /**< Offset: 0xFD8 (R/   32) DWT Peripheral Identification Register 6 */
  __I   uint32_t                       DWT_PIDR7;       /**< Offset: 0xFDC (R/   32) DWT Peripheral Identification Register 7 */
  __I   uint32_t                       DWT_PIDR0;       /**< Offset: 0xFE0 (R/   32) DWT Peripheral Identification Register 0 */
  __I   uint32_t                       DWT_PIDR1;       /**< Offset: 0xFE4 (R/   32) DWT Peripheral Identification Register 1 */
  __I   uint32_t                       DWT_PIDR2;       /**< Offset: 0xFE8 (R/   32) DWT Peripheral Identification Register 2 */
  __I   uint32_t                       DWT_PIDR3;       /**< Offset: 0xFEC (R/   32) DWT Peripheral Identification Register 3 */
  __I   uint32_t                       DWT_CIDR0;       /**< Offset: 0xFF0 (R/   32) DWT Component Identification Register 0 */
  __I   uint32_t                       DWT_CIDR1;       /**< Offset: 0xFF4 (R/   32) DWT Component Identification Register 1 */
  __I   uint32_t                       DWT_CIDR2;       /**< Offset: 0xFF8 (R/   32) DWT Component Identification Register 2 */
  __I   uint32_t                       DWT_CIDR3;       /**< Offset: 0xFFC (R/   32) DWT Component Identification Register 3 */
} dwt_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAML10_DWT_COMPONENT_H_ */
